/* 
输入格式
　　输入在一行中给出 4 个数，逗号分隔，每个数取值在 [-1,1]区间，满足平方和=1。
输出格式
　　输出矩阵R，每行中数据之间空格分隔。
样例输入
0.702857, -0.544630, 0.417666, 0.186883
样例输出
0.581260   -0.717651   0.383555
-0.192243   0.336906   0.562030
-0.790683 -  0.609485   0.057866*/
#include<stdio.h>
int main(){
	double q1,q2,q3,q4;
	scanf("%lf,%lf,%lf,%lf",&q1,&q2,&q3,&q4);
	double R[3][3];
	R[0][0]=q1*q1+q2*q2-q3*q3-q4*q4;
	R[0][1]=2*(q2*q3-q1*q4);
	R[0][2]=2*(q2*q4+q1*q3);
	R[1][0]=2*(q2*q3+q1*q4);
	R[1][1]=q1*q1-q2*q2+q3*q3-q4*q4;
	R[1][2]=2*(q2*q4-q1*q2);
	R[2][0]=2*(q2*q4-q1*q3);
	R[2][1]=2*(q3*q4+q1*q2);
	R[2][2]=q1*q1-q2*q2-q3*q3+q4*q4;
	for(int i=0;i<3;i++){
		for(int j=0;j<3;j++){
			printf("%.6lf ",R[i][j]);
		}
		printf("\n");
	}
	return 0;
}
